In [27]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm
from scipy.stats import f_oneway

In [28]:
ls

 Volume in drive C has no label.
 Volume Serial Number is FEA4-9C8F

 Directory of C:\Users\mrsks\OneDrive\Desktop\Data Science - Somnath\Assignments - Final\3. Hypothesis Testing

20-07-2022  18:13    <DIR>          .
20-07-2022  17:48    <DIR>          ..
20-07-2022  18:06    <DIR>          .ipynb_checkpoints
20-07-2022  17:48                87 BuyerRatio.csv
20-07-2022  17:48            13,423 Costomer+OrderForm.csv
20-07-2022  17:48               525 Cutlets.csv
20-07-2022  17:48            61,688 Hypothesis_Testing_Assignment.pptx
20-07-2022  17:48             3,487 LabTAT.csv
20-07-2022  18:04            47,438 Q1. Cutlets_Hypothesis Testing.ipynb
20-07-2022  18:13            18,691 Q2. LabTAT_Hypothesis Testing.ipynb
               7 File(s)        145,339 bytes
               3 Dir(s)  419,910,819,840 bytes free

In [29]:
Labtat=pd.read_csv('LabTAT.csv')
Labtat

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [30]:
pd.DataFrame(Labtat)

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [31]:
Labtat.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [32]:
labA=pd.Series(Labtat.iloc[:,0])
labA

0      185.35
1      170.49
2      192.77
3      177.33
4      193.41
        ...
115    178.49
116    176.08
117    202.48
118    182.40
119    182.09
Name: Laboratory 1, Length: 120, dtype: float64

In [33]:
labB=pd.Series(Labtat.iloc[:,1])
labB

0      165.53
1      185.91
2      194.92
3      183.00
4      169.57
        ...
115    170.66
116    183.98
117    174.54
118    197.18
119    215.17
Name: Laboratory 2, Length: 120, dtype: float64

In [34]:
labC=pd.Series(Labtat.iloc[:,2])
labC

0      176.70
1      198.45
2      201.23
3      199.61
4      204.63
        ...
115    193.80
116    215.25
117    203.99
118    194.52
119    221.49
Name: Laboratory 3, Length: 120, dtype: float64

In [35]:
labD=pd.Series(Labtat.iloc[:,3])
labD

0      166.13
1      160.79
2      185.18
3      176.42
4      152.60
        ...
115    172.68
116    177.64
117    170.27
118    150.87
119    162.21
Name: Laboratory 4, Length: 120, dtype: float64

In [36]:
statistic, pvalue =f_oneway(labA,labB,labC,labD)
alpha=0.05

print("p value is ",pvalue)
if pvalue<=alpha:
    print("Reject H0")
else:
    print("H0 holds true")

p value is  2.1156708949992414e-57
Reject H0

Hence the null hypothesis is rejected. That means that there is difference in average TAT among the different laboratories.